design docs added
